v13/advection-diffusionOF13/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "287";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// UFieldVal       (1 0 0);
// internalField   uniform ${UFieldVal};

internalField   uniform (1 0 0);

boundaryField
{

    left
    {
        // type            fixedValue;
        // value           uniform ${UFieldVal};
        
        // type            fixedValue;
        // value           uniform (1 0 0);
        
        type            fixedValue;
        value           $internalField;
    }
    right
    {

        // type            fixedValue;
        // value           uniform ${UFieldVal};
        
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
