v13/advection-diffusionOF13/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// TFieldVal 0;

defaultFieldValues
(
    // volScalarFieldValue T $TFieldVal
    volScalarFieldValue T 0
);

high 1e5;
low -1e5;

regions
(
    boxToCell
    {
        box (0.5 $low $low) (1.5 $high $high);
        fieldValues
        (
            volScalarFieldValue T 10
        );
    }
);


// ************************************************************************* //
